#include "modding.h"
#include "global.h"
#include "recomputils.h"
#include "recompconfig.h"
#include "z_boss_07.h"
#include "z64shrink_window.h"
#include "attributes.h"
#include "assets/objects/gameplay_keep/gameplay_keep.h"
#include "overlays/actors/ovl_En_Bom/z_en_bom.h"
#include "overlays/actors/ovl_En_Clear_Tag/z_en_clear_tag.h"
#include "overlays/actors/ovl_Obj_Tsubo/z_obj_tsubo.h"
#include "overlays/effects/ovl_Effect_Ss_Hahen/z_eff_ss_hahen.h"

#define MAJORA_TENTACLE_COUNT 30
#define MAJORA_WHIP_LENGTH 55
#define MAJORA_EFFECT_COUNT 60

typedef enum MajoraEffectType {
    /* 0 */ MAJORA_EFFECT_NONE,
    /* 1 */ MAJORA_EFFECT_FLAME
} MajoraEffectType;

typedef enum MajorasWrathAttackSubAction {
    /* 0 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_QUICK_WHIP,
    /* 1 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_FLURRY,
    /* 2 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_DOUBLE_WHIP,
    /* 3 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_LONG_WHIP,
    /* 4 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_SPIN_ATTACK,
    /* 5 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_TAUNT,
    /* 6 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_THREE_HIT,
    /* 7 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_WHIP_ATTACK_MAX,
    /* 7 */ MAJORAS_WRATH_ATTACK_SUB_ACTION_KICK = 7,
} MajorasWrathAttackSubAction;

void Boss07_Init(Actor* thisx, PlayState* play2);
void Boss07_Destroy(Actor* thisx, PlayState* play2);

void Boss07_Wrath_Update(Actor* thisx, PlayState* play2);
void Boss07_IncarnationAfterimage_Update(Actor* thisx, PlayState* play2);

void Boss07_Wrath_DrawShadowTex(u8* tex, Boss07* this, PlayState* play);

void Boss07_Incarnation_SetupIntroCutscene(Boss07* this, PlayState* play);
void Boss07_Incarnation_IntroCutscene(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupTaunt(Boss07* this, PlayState* play);
void Boss07_Incarnation_Taunt(Boss07* this, PlayState* play);
void Boss07_Incarnation_Stunned(Boss07* this, PlayState* play);
void Boss07_Incarnation_Damaged(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupRun(Boss07* this, PlayState* play);
void Boss07_Incarnation_Run(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupAttack(Boss07* this, PlayState* play);
void Boss07_Incarnation_Attack(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupSquattingDance(Boss07* this, PlayState* play);
void Boss07_Incarnation_SquattingDance(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupMoonwalk(Boss07* this, PlayState* play);
void Boss07_Incarnation_Moonwalk(Boss07* this, PlayState* play);
void Boss07_Incarnation_SetupPirouette(Boss07* this, PlayState* play);
void Boss07_Incarnation_Pirouette(Boss07* this, PlayState* play);
void Boss07_Incarnation_DeathCutscene(Boss07* this, PlayState* play);

void Boss07_Mask_SetupIdle(Boss07* this, PlayState* play);
void Boss07_Mask_Idle(Boss07* this, PlayState* play);
void Boss07_Mask_SetupSpinAttack(Boss07* this, PlayState* play);
void Boss07_Mask_SpinAttack(Boss07* this, PlayState* play);
void Boss07_Mask_Stunned(Boss07* this, PlayState* play);
void Boss07_Mask_Damaged(Boss07* this, PlayState* play);
void Boss07_Mask_SetupFireBeam(Boss07* this, PlayState* play);
void Boss07_Mask_FireBeam(Boss07* this, PlayState* play);
void Boss07_Mask_SetupIntroCutscene(Boss07* this, PlayState* play);
void Boss07_Mask_IntroCutscene(Boss07* this, PlayState* play);
void Boss07_Mask_SetupDeathCutscene(Boss07* this, PlayState* play);
void Boss07_Mask_DeathCutscene(Boss07* this, PlayState* play);

void Boss07_Remains_SetupIntroCutscene(Boss07* this, PlayState* play);
void Boss07_Remains_IntroCutscene(Boss07* this, PlayState* play);
void Boss07_Remains_SetupMove(Boss07* this, PlayState* play);
void Boss07_Remains_Move(Boss07* this, PlayState* play);
void Boss07_Remains_SetupStunned(Boss07* this, PlayState* play);
void Boss07_Remains_Stunned(Boss07* this, PlayState* play);

void Boss07_Top_SetupThrown(Boss07* this, PlayState* play);
void Boss07_Top_Thrown(Boss07* this, PlayState* play);
void Boss07_Top_SetupMove(Boss07* this, PlayState* play);
void Boss07_Top_Move(Boss07* this, PlayState* play);

void Boss07_BattleHandler_UpdateEffects(PlayState* play);
void Boss07_BattleHandler_DrawEffects(PlayState* play);

extern Boss07* sMajorasWrath;
extern Boss07* sMajoraBattleHandler;
extern Boss07* sMajorasMask;
extern Boss07* sMajoraRemains[MAJORA_REMAINS_TYPE_MAX];
extern void Boss07_Mask_SetupStunned(Boss07*, PlayState*);

extern u8 sKillAllProjectiles;
extern u8 sMusicStartTimer;

extern void Boss07_SmoothStop(Boss07*, f32);

typedef struct MajoraEffect {
    /* 0x00 */ u8 type;
    /* 0x02 */ s16 texScroll;
    /* 0x04 */ Vec3f pos;
    /* 0x10 */ Vec3f velocity;
    /* 0x1C */ Vec3f accel;
    /* 0x28 */ UNK_TYPE1 unk28[4];
    /* 0x2C */ s16 alpha;
    /* 0x2E */ UNK_TYPE1 unk2E[2];
    /* 0x30 */ s16 isFadingAway;
    /* 0x34 */ f32 scale;
    /* 0x38 */ UNK_TYPE1 unk38[0x10];
} MajoraEffect; // size = 0x48

extern MajoraEffect sMajoraEffects[MAJORA_EFFECT_COUNT];

extern ColliderJntSphInit sIncarnationBodyColliderJntSphInit;
extern ColliderJntSphInit sWrathKickColliderJntSphInit;
extern ColliderJntSphInit sWrathBodyColliderJntSphInit;
extern ColliderQuadInit sMaskBackQuadInit;
extern ColliderQuadInit sMaskFrontQuadInit;
extern DamageTable sRemainsDamageTable;
extern DamageTable sTopDamageTable;

typedef enum MajorasMaskDamageEffect {
    // Named because everything with this effect is ignored thanks to `CollisionCheck_SetATvsAC`.
    /* 0x0 */ MAJORAS_MASK_DMGEFF_IMMUNE,
    /* 0x2 */ MAJORAS_MASK_DMGEFF_FIRE_ARROW = 2,
    /* 0x3 */ MAJORAS_MASK_DMGEFF_ICE_ARROW,
    /* 0x4 */ MAJORAS_MASK_DMGEFF_LIGHT_ARROW,
    /* 0x9 */ MAJORAS_MASK_DMGEFF_SWORD_BEAM = 9,
    /* 0xF */ MAJORAS_MASK_DMGEFF_DAMAGE = 0xF
} MajorasMaskDamageEffect;

static DamageTable sMajorasMaskDamageTable = {
